import { loadCSS, unloadCSS } from "../utils/cssloader.js";

export function renderAboutUs(mainContent) {
  unloadCSS("./assets/styles/home.css");
  loadCSS("./assets/styles/aboutus.css");
  mainContent.innerHTML = `
   <div class="container text-center">
        <!-- Logo Section -->
        <img src="./assets/images/logo.svg" alt="شركة خطوات التنقية التجارية - فلاتر المياه" class="img-fluid w-60 p-2">


        <!-- Content Section -->
        <div class="row content-section w-100 p-5">
            <div class="h3">من نحن</div>

            <span>
                "شركة خطوات التنقية التجارية" شركة متخصصة في تقديم حلول شاملة للمياه في المملكة العربية السعودية. نحن نهتم
                بتلبية احتياجات عملائنا من خلال تقديم خدمات تركيب وصيانة فلاتر المياه، وتركيب وصيانة محطات تحلية المياه،
                وخدمات تحليل وفحص المياه، وتركيب أجهزة تبريد الخزانات، وتنظيف الخزانات.
                <br>
                تتميز شركتنا بتوفير خدمات عالية الجودة والمهنية لجميع عملائنا. نحن نعمل بجد لتحقيق رضا العملاء من خلال
                تقديم أفضل الخدمات والحلول التي تلبي احتياجاتهم.
                <br>
                فريق عملنا مؤهل ومدرب على أعلى مستوى لتقديم الخدمات بشكل احترافي ومهني. نحن نستخدم أحدث التقنيات
                والأدوات لتلبية احتياجات عملائنا بكفاءة عالية وبأفضل الطرق الممكنة.
                
                <br><br>
            </span>
            <h3>لماذا نحن؟</h3>
                <ul class="list-unstyled">
                    <li>🔹 فريق عمل مؤهل ومدرب على أعلى مستوى.</li>
                    <li>🔹 استخدام أحدث التقنيات والأدوات في مجال المياه.</li>
                    <li>🔹 أسعار تنافسية وضمان رضا العملاء.</li>
                </ul>
                <h3>رؤيتنا</h3>
                <p>
                    نهدف إلى أن نكون الشركة الرائدة في مجال حلول المياه، من خلال تقديم خدمات مبتكرة وعالية الجودة تلبي احتياجات عملائنا وتساهم في تحسين جودة الحياة.
                </p>
                <h3>اتصل بنا</h3>
                <p>
                    إذا كنت تبحث عن شركة موثوقة لتلبية احتياجاتك في مجال المياه، فلا تتردد في التواصل معنا. نحن هنا لخدمتك وتقديم أفضل الحلول.
                </p>
        </div>
    </div>
  `;
}
